#!/usr/bin/env python 
# -*- coding: utf-8 -*-
import telebot

bot = telebot.TeleBot('1062374700:AAEMAfONXupcfyOPFC5qRuW0hggQ9omWEsE')
keyboard1 = telebot.types.ReplyKeyboardMarkup(1)
keyboard1.row('Данилівна', 'Руслана',"Євстахівна")
keyboard1.row('Санич')
keyboard1.row('Теодозівна','Струсиха','Запорожець')

@bot.message_handler(commands=['start'])
def start_message(message):
    if message.text == '/start':
        bot.send_message(message.chat.id, '**Щоб побачити вчителів нажми на кнопку**', reply_markup=keyboard1, parse_mode="markdown")
        
@bot.message_handler(content_types=['text'])
def send_text(message):
    if message.text.lower() == 'данилівна':
        with open('IMG_20191108_211314_814.jpg','rb') as photo:
            bot.send_photo(message.chat.id, photo, "Ну ти мене не слухаєш\nВийди, вимочи мочалку\nРубан до дошки\nХто сьогодні чергує, дивлюсь в журнал , по списку\nПоставлять мені дошку, і будемо дивитись відео в вітубі\nТут маленька дирочка на парті, хто це зробив\nПрибиральниця, все поприбирає\nХто вазонки рухав?\nА що це приклеїне на вікні?\nКурило, підлий квіти і вимочи мочалку\nДіти я до вас добре відношусь , а ви до мене так\nНе знімайте мене на відео, я буду дуже переживати\nПерепрошую, я тут речі покладу")
    
    elif message.text.lower() == 'руслана':
       with open('IMG_20191108_190339.jpg','rb') as photo:
            bot.send_photo(message.chat.id, photo, "Сину\nСонце моє\nЯ буваю добра і дуже добра\nЯ любима вчителька\nДістаємо листочки, пишемо самостійну\nЯ вас вітаю, ви получили 12 балів\nДля мене розмір не головне\nТяжке дитинство\nЗнаєте, як в тому анегдоті...\nВже всі пси з мого року поздихали")
   
    elif message.text.lower() == 'санич':
        with open('IMG_20191108_214232_358.jpg','rb') as photo:
            bot.send_photo(message.chat.id, photo, "Еееййй\nЇдем в Карпати\nЗдаєм по 1000 грн, автобус дорогий, я нічо не можу зробити\nВ мене Джура\nЗіболки всьо самі, я їм нічо не підсуджував\nЙдем на стадіон\nЯ не поняв\nЧо на 1 уроці не була?\nА мама знає?\nНе хватає 5 джигітів\nЗавтра біологія😍😍😍\nА прапор видно?\nТанцюєм співаєм, все хватить\nТо поцілунок на губі\nХлопці, парти носити\nВи під олівчик попали вже")
    
    elif message.text.lower() == 'євстахівна':
       with open('IMG_20191108_182635_776.jpg','rb') as photo:
            bot.send_photo(message.chat.id, photo, "ЗЕ ЕН О\nДем‘янович, ти хворіла стільки часу?\nТочно хворіла?\nБокало має золоті руки\nДоброго Здоров‘ячка\nЗ Богом Парасю\nНе велике дякую, дякую не може бути велике або маленьке, сама ще плутаюсь\nНе доброго дня, а добрий день пправильно\nЯ з Авраменком інколи не погоджуюсь\nТой шоколадний сатана\nВойтович, то правда шо ти 11 клас з нами не вчишся?\nЯ сиджу і згадую чи Войтович знов по якихось громадських справах бігала\nВойтович,ти шо в поїзді їхала і писала ?\nШалений почерк\nКурило, мегі шкода ту людину, котра буде перевіряти на зно твій твір\nЦе Жах... 48 помилок\nЯ деколи думаю, вчу я шось трохи в тій школі чи зовсім не вчу нічо\nПилосою, носю, косю траву")

    elif message.text.lower() == "теодозівна":
       with open('IMG_20191108_214754_654.jpg','rb') as photo:
            bot.send_photo(message.chat.id, photo,  'Бабо, пукнися в голову\nЗакрий вулицю\nНатко, ти здуріла?\nЧужий зайшов до хати\nЯ чую шум на останній лавці\nЯ може і погано бачу, але чую я дуже добре\nА де Олежик?\nГоворили, балакали, сіли везлися\nЗакрили, відкрили, опустили\nМасони.... це сила....уххххх\nДе манери?\nПані Войтович, красуняяя\nПані Голяк, сестричка дитинка скарбинка','rb')
            
    elif message.text.lower() == 'струсиха':
        with open('IMG_20191108_215042_242.jpg','rb') as photo:
            bot.send_photo(message.chat.id, photo , 'Какой привет-такой ответ\nРиба привипава\nЧьо чьо?\nЯ врятувала стільком людям життя\nСмаркачі і смаркулі\nДля мене шкова- це храм науки\nЯ не чува\nЯ не перевірила самостійну, мені зараз не до цього\nА мій внук...')            
    elif message.text.lower() == 'запорожець':
        with open('IMG_20191108_215046_484.jpg','rb') as photo:
            bot.send_photo(message.chat.id, photo, 'І будеш мати до мене жаль\nБісссовісні\nА мені булочку?\nЗНО пиши на 10, в атестаті буде 6\nХодіть до кого хочете, мені всерівно\nМені пташечка нашептала, шо ти до репетитора ходиш' )          

bot.polling(none_stop=True)